<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 11 changes.</summary>

```diff
+ tailscale_tailnet_key.tailscale_key will be created
+ module.debian13.proxmox_virtual_environment_vm.vm will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"] will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"] will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"] will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] will be created
+ module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] will be created
+ module.ubuntu22.proxmox_virtual_environment_vm.vm will be created
+ module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
+ module.debian13.module.cloud_image["0"].proxmox_virtual_environment_download_file.image will be created
+ module.ubuntu22.module.cloud_image["0"].proxmox_virtual_environment_download_file.image will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 11 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-16T18:29:54Z [(view log)](https://github.com/perchnet/p/actions/runs/17011591535/job/48228361350#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.debian13.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "ovmf"
      + description             = "Terraform VM created on 2025-08-15T02:28:26Z"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "debian13"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "debian",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 9013

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + import_from       = (known after apply)
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + efi_disk {
          + datastore_id      = "zssd"
          + file_format       = "raw"
          + pre_enrolled_keys = false
          + type              = "4m"
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum                = "435fade994d94c47802bb4e02693c848818758745489c1715e4e5801f5aaa3a8"
      + checksum_algorithm      = "sha256"
      + content_type            = "import"
      + datastore_id            = "zssd-files"
      + decompression_algorithm = "zst"
      + file_name               = "TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.qcow2"
      + id                      = (known after apply)
      + node_name               = "pve1"
      + overwrite               = true
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = "https://builds.coreos.fedoraproject.org/prod/streams/testing/builds/42.20250803.2.0/x86_64/fedora-coreos-42.20250803.2.0-proxmoxve.x86_64.qcow2.xz"
      + verify                  = true
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "38557e6d8e8738392dc5959b679c4567dbe4ce6475aaa3ba054caab4f1e4f90876c49f6e20be79a5a151105e121f2e19a51319bdb0a223c90fea11b0a13deb25"
      + checksum_algorithm  = "sha512"
      + content_type        = "import"
      + datastore_id        = "zssd-files"
      + file_name           = "TFimg_debian-12-nocloud-amd64-2fbe.qcow2"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/bookworm/20250428-2096/debian-12-nocloud-amd64-20250428-2096.qcow2"
      + verify              = true
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "046d9691b1a6026fd457b85c85476fa721249dd9379e23ab877bb34b2d6fa662994b03a23ffe7b527c5421cb1a69e81b6873c82f0e1ac9403bbaad263fffd3d8"
      + checksum_algorithm  = "sha512"
      + content_type        = "import"
      + datastore_id        = "zssd-files"
      + file_name           = "TFimg_debian-13-genericcloud-amd64-a110.qcow2"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/trixie/daily/20250619-2148/debian-13-generic-amd64-daily-20250619-2148.qcow2"
      + verify              = true
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + content_type        = "import"
      + datastore_id        = "zssd-files"
      + file_name           = "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"] will be created
  + resource "proxmox_virtual_environment_download_file" "images" {
      + checksum            = "92d2c4591af9a82785464bede56022c49d4be27bde1bdcf4a9fccc62425cda43"
      + checksum_algorithm  = "sha256"
      + content_type        = "import"
      + datastore_id        = "zssd-files"
      + file_name           = "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/noble/20250610/noble-server-cloudimg-amd64.img"
      + verify              = true
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Terraform VM created on 2025-08-15T02:28:28Z"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "ubuntu22"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "ubuntu",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 8022

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + import_from       = (known after apply)
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = false
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be created
  + resource "proxmox_virtual_environment_vm" "vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Terraform VM created on 2025-08-16T06:33:08Z"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "vm-debian13-minimal"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-single"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + tags                    = [
          + "terraform",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "pve1"
          + retries   = 1
          + vm_id     = (known after apply)
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 10
          + ssd               = false
        }
      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zssd"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = "vm-131-disk-0"
          + replicate         = true
          + size              = 1
          + ssd               = false
            # (1 unchanged attribute hidden)
        }

      + initialization {
          + datastore_id         = "local"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = "snippets:snippets/a19c397a81064341.user-data.yaml"
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }

      + memory {
          + dedicated      = 1024
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + serial_device {
          + device = "socket"
        }

      + vga {
          + memory = 16
          + type   = "std"
        }
    }

  # module.debian13.module.cloud_image["0"].proxmox_virtual_environment_download_file.image will be created
  + resource "proxmox_virtual_environment_download_file" "image" {
      + checksum            = "a7dfe434afc40afb0a791c777f3edba6b1a5c4b7315a61073fe5e34752d3bc5fd44ff67ef054eb4263687a97f7ce4896bf5bad5f216ef8b9d4a84541759e743d"
      + checksum_algorithm  = "sha512"
      + content_type        = "import"
      + datastore_id        = "zssd-files"
      + file_name           = "debian-13-generic-amd64.img"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud.debian.org/images/cloud/trixie/20250806-2196/debian-13-generic-amd64-20250806-2196.qcow2"
      + verify              = true
    }

  # module.ubuntu22.module.cloud_image["0"].proxmox_virtual_environment_download_file.image will be created
  + resource "proxmox_virtual_environment_download_file" "image" {
      + checksum            = "7eb9f1480956af75359130cd41ba24419d6fd88d3af990ea9abe97c2f9459fda"
      + checksum_algorithm  = "sha256"
      + content_type        = "import"
      + datastore_id        = "zssd-files"
      + file_name           = "ubuntu-22.04-server-cloudimg-amd64.img"
      + id                  = (known after apply)
      + node_name           = "pve1"
      + overwrite           = false
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/releases/22.04/release-20240207/ubuntu-22.04-server-cloudimg-amd64.img"
      + verify              = true
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ images = {
      ~ coreos_img               = {
          ~ content_type            = "iso" -> "import"
          ~ file_name               = "TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.img" -> "TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.qcow2"
          ~ id                      = "zssd-files:iso/TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.img" -> (known after apply)
          ~ size                    = 1985150976 -> (known after apply)
            # (10 unchanged attributes hidden)
        }
      ~ debian_bookworm          = {
          ~ content_type            = "iso" -> "import"
          ~ file_name               = "TFimg_debian-12-nocloud-amd64-2fbe.qcow2.img" -> "TFimg_debian-12-nocloud-amd64-2fbe.qcow2"
          ~ id                      = "zssd-files:iso/TFimg_debian-12-nocloud-amd64-2fbe.qcow2.img" -> (known after apply)
          ~ size                    = 419627008 -> (known after apply)
            # (10 unchanged attributes hidden)
        }
      ~ debian_trixie            = {
          ~ content_type            = "iso" -> "import"
          ~ file_name               = "TFimg_debian-13-genericcloud-amd64-a110.qcow2.img" -> "TFimg_debian-13-genericcloud-amd64-a110.qcow2"
          ~ id                      = "zssd-files:iso/TFimg_debian-13-genericcloud-amd64-a110.qcow2.img" -> (known after apply)
          ~ size                    = 434110464 -> (known after apply)
            # (10 unchanged attributes hidden)
        }
      ~ ubuntu_jammy             = {
          ~ content_type            = "iso" -> "import"
          ~ file_name               = "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.img" -> "TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow"
          ~ id                      = "zssd-files:iso/TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.img" -> (known after apply)
          ~ size                    = 677302272 -> (known after apply)
            # (10 unchanged attributes hidden)
        }
      ~ ubuntu_noble_cloud_image = {
          ~ content_type            = "iso" -> "import"
          ~ file_name               = "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.img" -> "TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow"
          ~ id                      = "zssd-files:iso/TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.img" -> (known after apply)
          ~ size                    = 613725184 -> (known after apply)
            # (10 unchanged attributes hidden)
        }
    }
```
</details>
<!-- placeholder-5 -->
<!-- terraform-61-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->